#pragma once

#include <QToolBar>


////////////////////////////////////////////////////////////////////////////////
//
/// Перечисление действий панели инструментов редактора
/**
*/
////////////////////////////////////////////////////////////////////////////////
enum class ToolBarAction
{
  None,                 // Инструмент не выбран
  LineSegment,          // Построение отрезка
  BrokenLine,           // Построение ломанной линии
  RectangleTwoPoints,   // Построение прямоугольника по двум точкам
  RectangleCenterAngle, // Построение прямоугольника по центру и углу
};


////////////////////////////////////////////////////////////////////////////////
//
/// Панель инструментов редактора
/**
*/
////////////////////////////////////////////////////////////////////////////////
class EditorToolBar : public QToolBar
{
	Q_OBJECT
public:
  EditorToolBar(QWidget * parent = nullptr);

signals:
  void toolChaned(ToolBarAction newAction);
};