#include <cmath>

#include <MathUtils.h>

#include <Vector.h>


//------------------------------------------------------------------------------
/**
  Перегруженный оператор сложения для вектора
*/
//---
Vector Vector::operator+(const Vector& rhs) const
{
  return {dx + rhs.dx, dy + rhs.dy};
}


//------------------------------------------------------------------------------
/**
  Перегруженный оператор добавления и присваивания для вектора
*/
//---
Vector& Vector::operator+=(const Vector& rhs)
{
  dx += rhs.dx;
  dy += rhs.dy;

  return *this;
}


//------------------------------------------------------------------------------
/**
  Перегруженный оператор вычитания для вектора
*/
//---
Vector Vector::operator-(const Vector& rhs) const
{
  return {dx - rhs.dx, dy - rhs.dy};
}


//------------------------------------------------------------------------------
/**
  Перегруженный оператор вычитания и присваивания для вектора
*/
//---
Vector& Vector::operator-=(const Vector& rhs)
{
  dx -= rhs.dx;
  dy -= rhs.dy;

  return *this;
}


//------------------------------------------------------------------------------
/**
  Перегруженный оператор умножения для вектора
*/
//---
Vector Vector::operator*(double rhs) const
{
  return {dx * rhs, dy * rhs};
}


//------------------------------------------------------------------------------
/**
  Перегруженный оператор умножения и присваивания для вектора
*/
//---
Vector& Vector::operator*=(double rhs)
{
  dx *= rhs;
  dy *= rhs;

  return *this;
}


//------------------------------------------------------------------------------
/**
  Перегруженный оператор равенства для вектора
*/
//---
bool Vector::operator==(const Vector& rhs) const
{
  return math_utils::doubleEQ(dx, rhs.dx) * math_utils::doubleEQ(dy, rhs.dy);
}


//------------------------------------------------------------------------------
/**
  Перегруженный оператор неравенства для вектора
*/
//---
bool Vector::operator!=(const Vector& rhs) const
{
  return !(*this == rhs);
}


//------------------------------------------------------------------------------
/**
  Длина вектора
*/
//---
double Vector::Length() const
{
  return std::hypot(dx, dy);
}
