#include <cmath>

#include <MathUtils.h>

#include <Vector.h>


//------------------------------------------------------------------------------
/**
  ѕерегруженный оператор сложени€ дл€ вектора
*/
//---
Vector Vector::operator+(const Vector& rhs) const
{
  return {x + rhs.x, y + rhs.y};
}


//------------------------------------------------------------------------------
/**
  ѕерегруженный оператор добавлени€ и присваивани€ дл€ вектора
*/
//---
Vector& Vector::operator+=(const Vector& rhs)
{
  x += rhs.x;
  y += rhs.y;

  return *this;
}


//------------------------------------------------------------------------------
/**
  ѕерегруженный оператор вычитани€ дл€ вектора
*/
//---
Vector Vector::operator-(const Vector& rhs) const
{
  return {x - rhs.x, y - rhs.y};
}


//------------------------------------------------------------------------------
/**
  ѕерегруженный оператор вычитани€ и присваивани€ дл€ вектора
*/
//---
Vector& Vector::operator-=(const Vector& rhs)
{
  x -= rhs.x;
  y -= rhs.y;

  return *this;
}


//------------------------------------------------------------------------------
/**
  ѕерегруженный оператор умножени€ дл€ вектора
*/
//---
Vector Vector::operator*(double rhs) const
{
  return {x * rhs, y * rhs};
}


//------------------------------------------------------------------------------
/**
  ѕерегруженный оператор умножени€ и присваивани€ дл€ вектора
*/
//---
Vector& Vector::operator*=(double rhs)
{
  x *= rhs;
  y *= rhs;

  return *this;
}


//------------------------------------------------------------------------------
/**
  ѕерегруженный оператор равенства дл€ вектора
*/
//---
bool Vector::operator==(const Vector& rhs) const
{
  return math_utils::doubleEQ(x, rhs.x) * math_utils::doubleEQ(y, rhs.y);
}


//------------------------------------------------------------------------------
/**
  ѕерегруженный оператор неравенства дл€ вектора
*/
//---
bool Vector::operator!=(const Vector& rhs) const
{
  return !(*this == rhs);
}


//------------------------------------------------------------------------------
/**
  ƒлина вектора
*/
//---
double Vector::Length() const
{
  return std::sqrt(x * x + y * y);
}
