#pragma once

////////////////////////////////////////////////////////////////////////////////
//
/// Перечисление инструментов редактора
/**
*/
////////////////////////////////////////////////////////////////////////////////
enum class Tool
{
  None,                 // Инструмент не выбран
  LineSegment,          // Построение отрезка
  BrokenLine,           // Построение ломанной линии
  RectangleTwoPoints,   // Построение прямоугольника по двум точкам
  RectangleCenterAngle, // Построение прямоугольника по центру и углу
};
